"""checks the functions of the to_pdf module"""
from rss_package.to_pdf import PDF

"""test data to be validated"""
test_news = [
    {
        "url": "https://www.kommersant.ru/RSS/news.xml",
        "title": "Голикова заявила о высоких показателях смертности от COVID-19 в России",
        "link": "https://www.kommersant.ru/doc/5038708",
        "description": "В последние месяцы в России фиксируют «достаточно высокие» показатели смертности, сообщила вице-премьер РФ Татьяна Голикова. Она заявила, что основным профилактическим средством, которое помогает избежать летального исхода, является вакцинация.Госпожа Голикова также рассказала, что в Подмосковье, несмотря на рост заболеваемости COVID-19, смертность снижается. Коллективный иммунитетами в области оценивается в 64%.«Если мы посмотрим данные по заболеваемости по Московской области ежесуточные и данные по смертности, то мы увидим, что, несмотря на рост заболеваемости, смертность по Московской области снижается»,— пояснила она в эфире телеканала «Россия-24» (цитата по «РИА Новости»).За прошедшие сутки в России зафиксирован очередной рекорд — 33 208 заболевших и 1 002 умерших от COVID-19. Полную вакцинацию в стране прошли 47,5 млн человек, уровень коллективного иммунитета оценивается в 45%.На портале стопкоронавирус.рф запустили тепловую карту по эпидемиологической ситуации в российских регионах. Подробнее…",
        "pubdate": "Sat, 16 Oct 2021 14:35:00 +0300",
        "image": None
    },
    {
        "url": "https://www.kommersant.ru/RSS/news.xml",
        "title": "Убивший пять человек в Норвегии лучник мог сделать это из-за болезни",
        "link": "https://www.kommersant.ru/doc/5038707",
        "description": "Норвежская полиция считает, что Эспен Андерсен Братен, застреливший пять человек из лука, мог поступить так по причине болезни. Адвокат лучника согласился с предварительными выводами полиции, сообщает местный телеканал TV2. О каком диагнозе идет речь, не уточняется.В полиции рассматривают несколько причин нападения, в их числе — также месть и причастность к исламистским группировкам. Гипотезу о том, что причиной стала болезнь, следствие сочло «наиболее вероятной». Адвокат обвиняемого сказал, что он «согласен с предварительными выводами и оценками, сделанными полицией».Атака произошла вечером 13 октября в Конгсберге. Эспен Андерсен Братен, 37-летний гражданин Дании принявший ислам, устроил стрельбу из лука в супермаркете. Мужчину арестовали, полиция называла приоритетной версию теракта.Подробнее об атаке — в материале «Ъ» «Норвежский исламизм вооружился луком и стрелами».",
        "pubdate": "Sat, 16 Oct 2021 14:16:00 +0300",
        "image": None
    },
    {
        "url": "https://www.kommersant.ru/RSS/news.xml",
        "title": "В Россию с разрешения Росздравнадзора можно будет ввезти незарегистрированное лекарство",
        "link": "https://www.kommersant.ru/doc/5038704",
        "description": "Правительство дало Росздравнадзору право выдавать разрешения на ввоз в страну незарегистрированных лекарств для конкретных пациентов. Ведомство также получило функции по регистрации, проведению клинических исследований и мониторингу безопасности, качества и эффективности медизделий в соответствии с правилами Евразийского экономического союза.«Проект предусматривает наделение Росздравнадзора полномочиями по выдаче в установленном законодательством РФ порядке разрешения на ввоз на территорию РФ незарегистрированных медицинских изделий для оказания медицинской помощи по жизненным показаниям конкретного пациента; осуществление регистрационных процедур в отношении медицинского изделия в соответствии с правилами регистрации и экспертизы безопасности, качества и эффективности медицинских изделий, утвержденными решением Совета Евразийской экономической комиссии от 12 февраля 2016 года»,— говорится на сайте правительства.В последние годы не удавалось урегулировать ряд правовых вопросов, связанных со ввозом препаратов…",
        "pubdate": "Sat, 16 Oct 2021 13:26:00 +0300",
        "image": None
    },
    {
        "url": "https://www.kommersant.ru/RSS/news.xml",
        "title": "Оперштаб оценил уровень коллективного иммунитета к COVID-19 в России в 45%",
        "link": "https://www.kommersant.ru/doc/5038702",
        "description": "Полную вакцинацию от коронавируса в России прошли 47,5 млн человек, первый компонент вакцины получили 51 млн россиян. Уровень коллективного иммунитета в стране оценивается в 45%, сообщил оперативный штаб по борьбе с COVID-19. В Москве первую прививку сделали 5,1 млн человек, обе — 4,7 млн, коллективный иммунитет в городе оценивается в 61%.Сегодня, 16 октября, на портале стопкоронавирус.рф начали публиковать данные о вакцинации населения и достижении коллективного иммунитета. Также на сайте появилась тепловая карта по эпидемиологической ситуации в России и отдельно в регионах. С помощью тепловой карты можно оценить эпидемиологическую ситуацию по COVID-19. На карте используются четыре цвета — красный, оранжевый, желтый и зеленый. Цветовая индикация определяется пятью критериями: заболеваемость на 100 тыс. населения, охват тестированием, уровень коллективного иммунитета, занятость коек с аппаратами искусственной вентиляции легких и загруженность коечного фонда.«Красный цвет означает, что в регионе более…",
        "pubdate": "Sat, 16 Oct 2021 13:18:00 +0300",
        "image": None
    },
    {
        "url": "https://www.kommersant.ru/RSS/news.xml",
        "title": "В Турции в ДТП с автобусом пострадали семь россиян",
        "link": "https://www.kommersant.ru/doc/5038698",
        "description": "Восемь человек, в том числе семеро россиян, получили ранения в результате аварии туристического автобуса в турецкой провинции Анталья, сообщает газета Hurriyet. Генконсульство РФ в Анталье подтвердило эту информацию, пострадавших госпитализировали.Инцидент произошел в районе Манавгат около 8:00 (совпадает с мск), туристов развозили из аэропорта в отели. Hurriyet пишет, что автобус потерял управление и перевернулся на скользкой после дождя дороге. Двери автобуса были заблокированы, и туристам пришлось разбить лобовое стекло, чтобы выбраться наружу. На место инцидента направили полицию, бригаду врачей и пожарных.Сотрудники генконсульства РФ уже связались с местными властями, туроператором и медучреждениями, куда доставили россиян. «В ДТП пострадали семь граждан России... Правоохранительные органы выясняют причины и обстоятельства аварии»,— сообщил «РИА Новости» представитель консульства.",
        "pubdate": "Sat, 16 Oct 2021 12:57:00 +0300",
        "image": None
    },
    {
        "url": "https://www.kommersant.ru/RSS/news.xml",
        "title": "США осудили перепись населения РФ в Крыму",
        "link": "https://www.kommersant.ru/doc/5038690",
        "description": "США осуждают проведение Россией переписи населения на территории Крыма, говорится в заявлении американского посольства в Киеве. Ранее перепись населения в Крыму также раскритиковали Евросоюз и Украина.«США осуждают перепись населения России в оккупированном Крыму как очередную попытку подорвать независимость, суверенитет и территориальную целостность Украины»,— говорится в заявлении посольства в Facebook.Крым вошел в состав России по результатам референдума в марте 2014 года. Украина и западные страны не признали проведение референдума и обвинили Россию в аннексии территории.Общенациональная перепись населения России стартовала накануне, 15 октября. Пройти процедуру можно на сайте госуслуг или в многофункциональных центрах, получив по итогам QR-код — его следует предъявить традиционному переписчику, когда тот постучится в квартиру.Подробнее о переписи — в материале «Ъ» «По стране пойдут люди в шарфах и с фонарями».",
        "pubdate": "Sat, 16 Oct 2021 12:32:00 +0300",
        "image": None
    },
    {
        "url": "https://www.kommersant.ru/RSS/news.xml",
        "title": "В 2021 году Россия установит рекорд по внутреннему потреблению газа",
        "link": "https://www.kommersant.ru/doc/5038689",
        "description": "Вице-премьер Александр Новак сообщил, что по итогам 2021 года в России может быть установлен рекорд по внутреннему потреблению газа. Он добавил, что, несмотря на это, страна готова предоставить Европе дополнительные поставки, но заявок от ЕС не было.«У нас, кстати, я хочу отметить, что в России тоже в этом году рекордные показатели потребления газа. Внутри страны. В том числе это связано с активным восстановлением экономики в посткризисный период»,— сказал господин Новак в эфире телеканала «Россия-24» (цитата по ТАСС).Помимо восстановления после кризиса на фоне пандемии коронавируса, на динамике потребления газа сказались снижение выработки электроэнергии на гидроэлектростанциях и последствия прошедшей длительной и холодной зимы. С июля фьючерсы на газ в Европе начали резко дорожать, 6 октября их стоимость достигла пика — $1900, после чего стала снижаться. В Еврокомиссии связывали рост цен на газ и электричество с рекордным за 25 лет спросом на энергоносители. Президент РФ Владимир Путин говорил о…",
        "pubdate": "Sat, 16 Oct 2021 12:23:00 +0300",
        "image": None
    },
    {
        "url": "https://www.kommersant.ru/RSS/news.xml",
        "title": "Александр Новак допустил повторение энергокризиса в Европе",
        "link": "https://www.kommersant.ru/doc/5038686",
        "description": "В подземных газовых хранилищах в Европе не хватает около 25 млрд куб. м газа, заявил вице-премьер РФ Александр Новак. По его словам, происшедший в Европе этой осенью энергетический кризис может повториться в будущем. Решение ЕС перейти на «зеленую» энергетику он считает ошибочным. Господин Новак отметил, что Россия «готова к диалогу» с европейскими странами по поставкам газа. «Мы готовы сесть с нашими европейскими партнерами, коллегами, и здесь речь идет не только о текущем газовом сезоне, такая ситуация не исключена, что может повториться»,— сказал он в передаче «Вести в субботу» на телеканале «Россия-1» (цитата по «Интерфаксу»).По словам вице-премьера, Европа делает ставку на возобновляемые источники энергии (ВИЭ), но он считает такой подход ошибочным. «Политики могут говорить что угодно, но экономика потом все равно вылезает... Да, политики не хотят принимать там своих ошибок»,— считает он.Александр Новак уточнил, что в этом году в России также были зафиксированы рекордные показатели потребления…",
        "pubdate": "Sat, 16 Oct 2021 12:13:00 +0300",
        "image": None
    },
    {
        "url": "https://www.kommersant.ru/RSS/news.xml",
        "title": "Суточная заболеваемость COVID-19 в Москве третий день превышает 6 тысяч",
        "link": "https://www.kommersant.ru/doc/5038680",
        "description": "В Москве за прошедшие сутки выявили 6545 заболевших коронавирусом, сообщил оперативный штаб по борьбе с COVID-19. Уже три дня подряд суточная заболеваемость вирусом в столице превышает отметку 6 тыс. Накануне мэр города Сергей Собянин не исключил краткосрочного введения новых ограничений из-за роста числа зараженных. Общее число заболевших коронавирусом в Москве достигло 1 712 674. За прошедший день умерли 72 человека с COVID-19, всего — 30 093. Выздоровели за сутки 3637 человек, всего — 1 529 713.Источник РБК в московской мэрии сообщал, что власти обсуждают возможность возвращения QR-кодов для посещения ресторанов, если заболеваемость в столице будет держаться на уровне 6–7 тыс. случаев в день. По всей России сегодня, 16 октября, были обновлены максимумы по заболевшим COVID-19 (33 208 человек) и умершим (1 002) от коронавируса.Подробнее о ситуации с COVID-19 в Москве — в материале «Ъ FM» «Коронавирус набирает скорость».",
        "pubdate": "Sat, 16 Oct 2021 12:04:00 +0300",
        "image": None
    },
    {
        "url": "https://www.kommersant.ru/RSS/news.xml",
        "title": "Минтранс отложил ввод новых правил безопасности в малых аэропортах на год",
        "link": "https://www.kommersant.ru/doc/5038682",
        "description": "Вступление в силу новых требований безопасности к малым аэропортам отложено на год, заявил замминистра транспорта Александр Суханов. Ранее в связи с новыми правилами с октября приостановили полеты перевозчики, единственные для некоторых районов Сибири.«С учетом того, что проблема насущная и актуальная, мы прорабатываем вопрос о внесении изменений в действующее постановление [№1603]… и продлим еще на год,— заявил Суханов на парламентских слушаниях о развитии малых аэропортов.— Соответственно, у нас появится еще год с лишним для того, чтобы реализовать эти мероприятия».Ранее авиакомпания «Сибирская легкая авиация» и ее «дочка» «Аэросервис» приостановили полеты в Забайкальском крае, Томской области и на Алтае. Это единственные перевозчики между малыми аэропортами в этих трех регионах. Причиной приостановки полетов стало то, что малые аэропорты не могут выполнить новые требования по безопасности, вступившие в силу с октября и подразумевающие модернизацию посадочных площадок на сумму от 13 млн до 50 млн руб…",
        "pubdate": "Sat, 16 Oct 2021 12:00:00 +0300",
        "image": None
    }
]
test_path = "tests/test_news.pdf"
test_pdf = PDF(test_news, test_path)


def test_create_pdf():
    """verifies the creation of a test pdf file from test data"""
    assert test_pdf.create_pdf()


def test_new_pdf_file():
    """checks for the existence of the created test file"""
    with open(test_path):
        pass